from flask import Flask, render_template, request, make_response, jsonify, json
from werkzeug.utils import secure_filename
import re
import pandas as pd
import os
import main
app = Flask(__name__)
#app.config['MAX_CONTENT_LENGTH'] = 16 * 1024 * 1024 #파일 업로드 용량 제한 단위:바이트

#HTML 렌더링
@app.route('/')
def home_page():
   return render_template('home.html')


#업로드 HTML 렌더링
@app.route('/upload')
def upload_page():
   return render_template('upload.html')

#파일 업로드 처리
@app.route('/fileUpload', methods = ['GET', 'POST'])
def upload_file():
   if request.method == 'POST':
      f = request.files['file']
      #저장할 경로 + 파일명
      f.save('./test/' + secure_filename(f.filename))

      target = ["./test/" + f.filename]
      string = main.run(target)

      # 약 이름 리스트 생성
      medi_list = ['가바뉴로캡슐75밀리그램(프레가발린)', '가바론틴캡슐100밀리그램(가바펜틴)', '가바인캡슐300mg(가바펜틴)', '그로모정5밀리그램(피나스테리드)', '그린비정',
                '나인나인정', '넥스콘연질캡슐', '노즈클린연질캡슐', '노즈파워연질캡슐', '누리비타엠지연질캡슐', '뉴로카바피지캡슐300밀리그램(프레가발린)', '뉴바틴캡슐(가바펜틴)',
                '다보타민큐정', '대웅우루사연질캡슐', '동구리바스티그민타르타르산염캡슐6밀리그램', '동방프레가발린캡슐75mg(수출용)', '동화덴스톨캡슐', '디세린캡슐(디아세레인)',
                '디아로겐연질캡슐(수출용)', '디에스펜연질캡슐', '디이타민연질캡슐', '락스티올캅셀', '레드겔연질캡슐(수출용)', '레드톤연질캡슐(수출용)',
                '레미닐피알서방캡슐8밀리그램 (갈란타민브롬화수소산염)', '레이디원연질캡슐', '레이디퀸연질캡슐', '레테브모캡슐40밀리그램(셀퍼카티닙)', '로메가연질캡슐',
                '로세틴캡슐(플루옥세틴염산염)', '로아펜연질캡슐', '로이디펜캡슐', '로제코연질캡슐', '로페리놀에스캡슐', '리드테라비액티브정', '리발린캡슐150밀리그램(프레가발린)',
                '리버액트연질캡슐(수출용)', '리버엔에프연질캡슐', '마그페롤연질캡슐', '마도파정', '마도파정125', '마이류연질캡슐', '멀티브큐골드정', '멀티큐텐플러스정',
                '메가골드백정', '메가트루골드정', '메가트루파워정', '메가트루포커스정', '멘토비엠정', '명도파정25/100밀리그램', '명도파정50/200밀리그램',
                '모비록캄캡슐7.5mg(멜록시캄)', '미네큐비타정', '미카펜정', '바이타맥스골드정', '바이타액트프리미엄정', '벤포비백정',
                '복합엘씨500연질캡슐(수출명:MEGA-NAMIC)', '본밀연질캡슐(수출명:코스비타연질캡슐)', '브이코연질캡슐', '브이타민큐정', '블루콜엠연질캡슐',
                '블루콜연질캡슐(수출용)', '비나폴로프리미엄정', '비백큐골드정', '비타뉴론캡슐', '비타씬포르테엠정', '비타알부골드정', '비타콤보정', '비타화이트연질캡슐',
                '빅코민백골드정', '삐콤씨이브정', '세이브론캡슐 (수출명 : SEIBRON Capsule)', '센티렉스실버어드밴스정', '센티렉스어드밴스정',
                '셀듀록캡슐60밀리그램(둘록세틴염산염)', '셀지민정', '속크린에스정', '쉬버스탑연질캡슐', '슬라드린정', '신풍리바비린캡슐200밀리그람(수출용)',
                '실로딜서방캡슐200밀리그램(실로스타졸)', '쎄토마연질캡슐', '쎄토스연질캅셀', ' 쎈비백정', '쎈트란연질캡슐', '씨에스에이캡슐(니푸록사지드)(수출용)',
                '아노덱스골드정', '아로나민실버프리미엄정', '아미노피정', '아세페닌캡슐', '아세펙트캡슐(아세브로필린)', '아이덴캡슐(수출용)', '아이라이트연질캡슐',
                '아이프렐캡슐150밀리그램(프레가발린)', '아토세라캡슐25밀리그램(아토목세틴염산염)', '아트렌캡슐25mg(디아세레인)', '알시젠연질캡슐',
                '애니플루캡슐45밀리그램(오셀타미비르인산염)', '액티나민플러스정', '얼리펜연질캡슐', '에스트라시트캡슐140밀리그램(에스트라머스틴인산나트륨수화물)', '에이노즈연질캡슐',
                '엑세라민비정', '엑스비타에스정', '엑스비타제이정', '엑쎈코에스연질캡슐', '엑쎈코연질캡슐', '엘도스인캡슐(에르도스테인)', '엠코발캡슐(메코발라민)',
                '오디플루캡슐75밀리그램(오셀타미비르인산염)', '위편정', '유니작캡슐10밀리그램(플루옥세틴염산염) ', '유탐솔캡슐(염산탐스로신)', '이지덴캡슐',
                '이트클러캡슐250mg(세파클러수화물)', '익스타민비플러스정', '일양바이오오메프라졸캡슐', '임팩타민실버정', '임팩타민파워에이플러스정', '임팩타민파워정',
                '임팩타민프리미엄원스정', '임팩타민프리미엄정', '제스라-제트연질캡슐', '제이트란캡슐150밀리그램(다비가트란에텍실레이트)', '제텐비정', '제텐페롤연질캡슐',
                '젠빅연질캡슐', '지니펜정', '치탄캡슐(수출용)', '카프릴정25mg(캅토프릴)수출명:Captolongtablet25mg(captopril)',
                '캘코트정6밀리그람(데플라자코트(미분화))', '케이발린캡슐75밀리그램(프레가발린)', '코큐비타엠정', '코푸제로캡슐', '큐로이드정(피나스테리드)', '테라빅정',
                '테라코트정(데프라자코르트)', '테모람캡슐100밀리그램(테모졸로미드)', '토라맥정(토피라메이트)', '토라메이트정(토피라메이트)', '토라펜정100밀리그램(토피라메이트)',
                '토마스연질캡슐', '토맥정(토피라메이트)', '토코그린연질캡슐', '토코네슘연질캡슐', '토코빅연질캡슐', '토파민정(토피라메이트)', '토파스정100밀리그램(토피라메이트)',
                '토파씬정(토피라메이트)', '토파씬정50밀리그램(토피라메이트)(수출용)', '토파엠정100밀리그램(토피라메이트)', '토파원정100밀리그램(토피라메이트)',
                '토펙스정100밀리그람(토피라메이트)(수출용)', '토피라윈정100밀리그램(토피라메이트)', '토피라이정100밀리그램(토피라메이트)', '토피라정100밀리그램(토피라메이트)',
                '토피렌정100밀리그램(토피라메이트)', '토피메드정100밀리그램(토피라메이트) ', '토피메정100밀리그램(토피라메이트)', '토피버정100밀리그램(토피라메이트)',
                '토피스정100밀리그램(토피라메이트)', '토피스트정100밀리그램(토피라메이트)', '토피에이정(토피라메이트)', '토피칸정100밀리그람(토피라메이트)',
                '토피트정(토피라메이트)', '토핀정100밀리그램(토피라메이트)', '트레스비정', '트로피나정(피나스테리드)', '티세라캡슐10mg(티퀴쥼브롬화물)',
                '파나드정(피나스테리드)', '파나리드정5밀리그램(피나스테리드)', '파세드정(피나스테리드)', '파워에이정', '판베린연질캡슐', '퍼킨정25-250mg',
                '폰다미스정100밀리그램(토피라메이트)', '푸로케어정(피나스테리드)', '프디론정4밀리그램(메틸프레드니솔론)', '프란딘정6밀리그람(데프라자코르트)',
                '프레드윈정(메틸프레드니솔론)', '프레드정4밀리그램(메틸프레드니솔론)', '프레디정(메틸프레드니솔론)', '플루틴캡슐(플루옥세틴염산염)', '피나스테아정(피나스테리드)',
                '피나스티드정(피나스테리드)', '피엠에스가바펜틴캡슐400밀리그램', '하이씨디이연질캡슐', '핫도리정 ', '해소민에스캡슐', '헤레논연질캡슐',
                '헤파리빈연질캡슐(수출용)\n(수출명 : 멘스톤연질캡슐)', '헤파엘연질캡슐', '헤파칸연질캡슐', '홍화롤연질캅셀', '화콜씨노즈연질캡슐', '환인트라조돈염산염캡슐',
                '후세틴캡슐(플루옥세틴염산염)', '힙스브이파워정', '태극염산시프로플록사신정500밀리그램(수출용)', '엠피디엘정(메틸프레드니솔론)',
                '프라펙솔정0.5밀리그램(프라미펙솔염산염일수화물)', '훼리엠캡슐', '로사르플러스정', '하나부피바카인염산염주0.5%', '펜제로정',
                '오로페넴주500밀리그램(메로페넴수화물)', '대한프로카인2%주(프로카인염산염)', '제뉴원트리메부틴말레산염정', '일양라라포션액(L-아스파르트산-L-아르기닌수화물)',
                '광동벤포파워제트액', '루타인점안액(폴리데옥시리보뉴클레오티드나트륨)(1회용)', '벤포테인정', '아토노바정5/10밀리그램', '일양텔미사탄플러스정80/25밀리그램',
                '알옥시드정480밀리그램(알티옥트산트로메타민염)', '사포진정(사르포그렐레이트염산염)', '크라렉스주', '삼펜정(수출용)', '파라베졸정10밀리그램(라베프라졸나트륨)',
                '성우화학아스코르빈산과립(원료)', '마기스캅셀(수출용)', '뉴패스정(실로도신)', '쎄리진캡슐', '본덱스주(이반드론산나트륨일수화물)',
                '인데놀정40mg(프로프라놀롤염산염)', '제티스토정10/20밀리그램', '대신히드록시프로필셀룰로오스', '야일라정20밀리그램(바데나필염산염)',
                '아르테투엑스정(애엽95%에탄올연조엑스(20→1))', '원풍염산테르비나핀', '메네스정(베타히스틴메실산염)', '자이머정(메만틴염산염)',
                '태극아세틸에스캡슐(아세틸시스테인)', '디쿠아스-에스점안액3%(디쿠아포솔나트륨)(1회용)', '하벤큐연질캡슐', '에스비아정25밀리그램(시타글립틴염산염수화물)',
                '코노스캡슐', '엠트라캡슐(이트라코나졸)', '이글리드엠정1/250밀리그램', '네오셉트정10밀리그램(도네페질염산염일수화물)', '로수로드정20밀리그램(로수바스타틴칼슘)',
                '네오헤파캡슐(수출용)', '엑스반정160밀리그램(발사르탄)', '데소니드연고(부데소니드)', '프라작캡슐(플루옥세틴염산염)', '레보카신점안액1.5%(레보플록사신수화물)',
                '몬테포스츄정4mg(몬테루카스트나트륨)', '동구리바록사반정20밀리그램', '아세드린정', '토라빈안연고(토브라마이신)', '에취디졸비씨에이액',
                '하나막스정(수출명;DID HANAMAX Tablet)', '트로이카정40/5밀리그램', '대덕의료용산소', '셀탐주(설박탐나트륨·세포페라존나트륨)',
                '에프라닐정(에날라프릴말레산염)', '씨러젠정', '원풍염산암브록솔', '스타브론정(티아넵틴나트륨)', '리버포드정(테노포비르디소프록실푸마르산염)',
                '텔사탄정80밀리그램(텔미사르탄)', '비엔티정', '라프라이트정20mg(라베프라졸나트륨)', '대웅실로스타졸서방캡슐200밀리그램',
                '씨브리흡입용캡슐 50마이크로그램(글리코피로니움브롬화물)', '센티콜캡슐', '이타녹스정100밀리그램(이트라코나졸고체분산체)', '챔스탑정1밀리그램(바레니클린살리실산염)',
                '씨프로바이정250밀리그램(시프로플록사신염산염수화물)', '레보론정25밀리그램(레보설피리드)', '휴온스포도당주사액(20%)(수출명:광명포도당주사액20%)', '프리노즈정',
                '세피락스캡슐(세픽심수화물)(수출명:하원세믹심)(수출명:HAWONZENCEFAX)(수출용)',
                '페라씰린주4그람(주사용피페라실린나트륨)(수출명:삼씰린주4그람(주사용피페라실린나트륨)', '오마스트정(리마프로스트알파덱스)', '유영세파만돌주1그램(완충세파만돌나페이트)',
                '리세넥스플러스정', '유영네틸마이신주100밀리그램(네틸마이신황산염)', '트리노즈액', '시스로펜정(라베프라졸나트륨)(수출용)',
                '베아신정500밀리그램(시프로플록사신염산염수화물)', '스포라틴정(아세틸-L-카르니틴염산염)', '할로핀정(펠로디핀)', '포스콜린정(콜린알포세레이트)',
                '디멘솔정10mg(도네페질염산염일수화물)', '마인페시아정(피나스테리드)', '덱사졸린점안액(수출용)', '올듀오비정5/40밀리그램', '몬테케이세립4mg(몬테루카스트나트륨)',
                '트리메틴정(트리메부틴말레산염)', '니코에이껌(니코틴폴라크릴렉스)', '칼리테크정(칼리디노게나제)', '텔미암핀정80/5밀리그램', '아토젯정10/10밀리그램',
                '서울티스타정40/5밀리그램', '제일약품리도카인염산염수화물1%주(수출용)', '리트라젠듀오정2.5/850mg', '화일리도카인(원료)(수입)',
                '후루세프주(플로목세프나트륨)', '발사핀정5/80밀리그램', '실로스탄정(실로스타졸)(수출용)', '케프로텍플라스타(케토프로펜)', '모사탄정(모사프리드시트르산염수화물)',
                '록소프론정60밀리그램(록소프로펜나트륨수화물)', '클로디드정(클로피도그렐황산염)', '아투락토캡슐(락토바실루스아시도필루스균)(수출용)',
                '네메올정20밀리그램(에스오메프라졸마그네슘삼수화물)', '에소프라정20밀리그램(에스오메프라졸마그네슘이수화물)', '에스디핀정5밀리그램(에스암로디핀베실산염이수화물)',
                '파펙톤플러스캡슐', '가나텍정(이토프리드염산염)', '뉴로카바캡슐100밀리그램(가바펜틴)', '우리들산화마그네슘정', '토파맥스정25밀리그램(토피라메이트)',
                '미리보란정(수출용)', '싸이렉사정5밀리그램(올란자핀)(수출용)', '세플러캡슐(세파클러수화물)', '메가비액티브정', '뉴로핀정(옥시라세탐)(수출용)',
                '투엑스비골드100정', '자록사반정10밀리그램(리바록사반)', '인페나신정5mg(솔리페나신숙신산염)', '화원메칠프레드니솔론', '유디스캡슐', '레모나틴정',
                '디루칸정150밀리그램(플루코나졸)', '크래리트정500밀리그램(클래리트로마이신)', '클자핀정25밀리그램(클로자핀)', '바로메졸캡슐(오메프라졸)', '베이비원기소과립',
                '5%포도당키트주사', '시크린소프트 점안액', '토피린정25밀리그램(토피라메이트)', '태극크리미연고40%(산화아연)(수출명:다이퍼러쉬오인트먼트40%)(수출용)',
                '두타락연질캡슐0.5밀리그램(두타스테리드)', '에페리원정(에페리손염산염)', '알부토코연질캡슐', '라이트엔테카비르정1밀리그램(엔테카비르)', '화덕아라비아고무',
                '포말리스트캡슐1밀리그램(포말리도마이드)', '유시타정50밀리그램(시타글립틴염산염수화물)', '리피스타틴정10밀리그램(아토르바스타틴칼슘수화물)', '광동세페핌주1그램(수출용)',
                '피알콜레칼시페롤주', '알코텔정(메타독신)(수출명:알코테라)', '제이디핀정5밀리그램(암로디핀베실산염)', '프리카캡슐150밀리그램(프레가발린)',
                '티로프리정(티로프라미드염산염)', '토스롱액', '티로스타정(티로프라미드염산염)', '국전옥수수전분', '아로민필름코팅정', '인트로미녹시딜정', '원풍황납(원료)',
                '라이트솔리페나신정5밀리그램(솔리페나신숙신산염)', '메디몬트정10밀리그램(몬테루카스트나트륨)', '로제텔정80/20/10밀리그램', '시타폴민정50/1000밀리그램',
                '이브프리정', '하로핀정(펠로디핀)', '에페솔정(에페리손염산염)', '엑티온정(에제티미브)', '듀세틴캡슐30밀리그램(둘록세틴염산염)', '칸타칸듀오정20/32밀리그램',
                '삼성젬시타빈염산염주1그램', '순삭정(알벤다졸)', '큐덱시서방캡슐25밀리그램(토피라메이트)', '엠비카에이치씨티정5/40/12.5mg', '비페란플러스캡슐',
                '에이치엠씨엔에프산(과탄산나트륨)', '액소도스정', '싸이크로카푸론주사500밀리그램(트라넥사믹산)', '파트윈정40/10밀리그램', '디카테오정',
                '알피레보플록사신정250mg(레보플록사신수화물)', '우르디비캡슐', '텔탄지드정80/12.5밀리그램 ', '케이로틴정10mg(로수바스타틴칼슘)',
                '쎄레프로캡슐200mg(세레콕시브)', '페리돌정5밀리그램(할로페리돌)', '트리가정(트리메부틴말레산염)', '오에이비정10mg\n\n(솔리페나신숙신산염)',
                '유토젯정10/10mg', '몬테리진캡슐', '대신염산암브록솔(원료)', '에이프로젠세포탁심나트륨주500밀리그람(수출명:세포센트주500밀리그람)',
                '프레딘캡슐75밀리그램(프레가발린)', '크라목스정375밀리그람(아목시실린수화물,희석클라불란산칼륨(2:1))', '페니목스정500mg(아목시실린수화물·설박탐피복실)',
                '유토젯정10/40mg', '록소원정(록소프로펜나트륨)', '로자칸플러스프로정', '경보세프프로질건조시럽(세프프로질수화물)', '화이렉스정(클로르족사존)',
                '대신트리메토퀴놀염산염수화물(원료)', '넨시스판크레아틴I', '데노신주사(아데노신)', '티로스파정(티로프라미드염산염)', '알긴다액(알긴산나트륨)',
                '오코라졸정10밀리그램(라베프라졸나트륨)', '발탁스정100mg(실데나필시트르산염)', '비타셀렌정', '다이아닐피디-투액4.25%',
                '자누글리아정25밀리그램(시타글립틴염산염수화물)', '라베피아정20밀리그램(라베프라졸나트륨)', '라니드정(라니티딘염산염)', '디아릴정3밀리그램(글리메피리드)',
                '경남세포탁심주1그램(세포탁심나트륨(수출용)', '파이런스캡슐', '이토프딘정(이토프리드염산염)', '리메틴정200밀리그람(말레인산트리메부틴)', '국전아세클로페낙(원료)',
                '레미스타정(레바미피드)', '초당아픽사반정2.5밀리그램', '휴니즈멜록시캄캡슐7.5mg', '메가콘트정', '탐스서방정(탐스로신염산염)', '두배잘정',
                '심발타캡슐60밀리그램(둘록세틴염산염)', '파인콜린주(콜린알포세레이트)', '수바로오디정20밀리그램(로수바스타틴칼슘(미분화))', '솔리페노실정(솔리페나신숙신산염)',
                '경보세파졸린나트륨주250밀리그램(수출용)', '베노벡스겔', '엘뮤코정(에르도스테인)', '도파프로정2.0밀리그램(로피니롤염산염)', '하린서방정(펜톡시필린)',
                '시프록사신주(시프로플록사신)', '셀레뉴연질캡슐', '비디디정(비페닐디메칠디카르복실레이트)(수출용)', '셀트리온오메프라졸캡슐20밀리그램(오메프라졸)',
                '도모호론크림(클로베타솔프로피오네이트)', '경동헤모코아귤라제주', '리바록신정2.5밀리그램(리바록사반)', '화덕호박산독실아민',
                '코오롱실데나필시트르산염정50mg(실데나필시트르산염)(수출용)', '엠슈타인정50밀리그램(실데나필시트르산염)', '벤포큐정', '자누스정100밀리그램(시타글립틴인산염수화물)',
                '레보투스시럽(레보드로프로피진)', '올르메틴정20/10밀리그램', '보리코정200밀리그램(보리코나졸)', '성우화학말레인산돔페리돈', '한림네틸마이신황산염주사액100밀리그램',
                '타다포스정5mg(타다라필)', '에소메딘플러스정20/800밀리그램', '브로아이점안액(브롬페낙나트륨수화물)(1회용)', '헵사바정10밀리그램(아데포비어디피복실)',
                '리페딘정2밀리그램(리스페리돈)', '포사로닌정70밀리그람(알렌드론산나트륨수화물)', '프라탐서방정0.2mg(탐스로신염산염)', '장프리구강용해필름(시메티콘)(수출용)',
                '휴온스이트라코나졸정(이트라코나졸고체분산체)', '뉴프람정5밀리그램(에스시탈로프람옥살산염)', '프라바타딘정10mg(프라바스타틴나트륨)', '맥시펜정(덱시부프로펜 디. 씨.)',
                '톨마주(트라마돌염산염)(수출용)', '프로엠정5밀리그람(피나스테리드)', '동아슈프락스캡슐100밀리그램(세픽심수화물)', '데보날캡슐(수출용)',
                '아세텐캡슐200밀리그램(아세틸시스테인)', '콜대원콜드큐시럽', '종근당토파시티닙정5밀리그램', '리록시아캡슐2.5밀리그램(리바록사반)',
                '구미포비스왑스틱(포비돈요오드)(수출명:포비딕)', '아이필씨주(히알우론산나트륨)', '메디락포포산', '유니테리드정5밀리그램(피나스테리드)', '티리진정(세티리진염산염)',
                '아자렐정10밀리그램(리바록사반)', '디엔스에프연질캡슐(수출용)', '화일셀레늄함유건조효모(원료)', '테카비어정(테노포비르디소프록실)', '코디오칸정160/12.5밀리그람',
                '세트린정(세티리진염산염)(수출명:ANTIRIZINtab)', '메가케토겔(피록시캄)', '프라텐점안액(푸마르산케토티펜)', '넥소타정80밀리그램(페북소스타트)',
                '듀오포지정5/160밀리그램', '프레칸캡슐75밀리그램(프레가발린)', '니펜트주10mg(펜토스타틴)', '삼흥의료용산소',
                '유리스코정400밀리그람(노르플록사신)(수출용)(수출명:DAE HWA NORFLOXACIN 400mg)', '오로비카정10/40밀리그램', '위펜스정',
                '텔로크정80/20밀리그램', '히스콘주(피프린히드리네이트)', '라스틴정(라푸티딘)', '대봉엘에스0.1%시아노코발라민', '스피타신정(시프로플록사신염산염)',
                '쎈콜연질캡슐', '테르나핀겔(테르비나핀)', '오트엠정5밀리그램(올로파타딘염산염)', '쿠에티서방정150밀리그램(쿠에티아핀푸마르산염)', '포티크린가글액(포비돈요오드)',
                '라푸티정10밀리그램(라푸티딘)']
      df = pd.DataFrame(medi_list, columns=['name'])
      df['similirity'] = 0  # 유사도 칼럼 생성

      start_idx = string.index('용 법') + 7
      end_idx = string.index('조제시')

      result_1 = string[start_idx:end_idx]
      result_1 = result_1.split()

      # 숫자데이터, 특수문자 데이터 삭제
      pred_name = []
      for i in result_1:
         if len(i) >= 2:
            if i.isalnum():
               pred_name.append(i)
            else:
               pred_name.append(re.sub('[^A-Za-z0-9가-힣]', '', i))

      # n-gram 유사도이용

      final_result = []
      for word in pred_name:
         for i in range(len(word)):
            if i < (len(word) - 1):
               df.loc[df['name'].str.contains(word[i:i + 2]), 'similirity'] += 1
         if df['similirity'].max() == 0:
            continue
         print(df.iloc[df['similirity'].idxmax(), 0], df['similirity'].max())
         final_result.append(df.iloc[df['similirity'].idxmax(), 0])
         df['similirity'] = 0

      result = ' '.join(final_result)

   return build_actual_response(jsonify({ 'data': result}))
def build_preflight_response():
    response = make_response()
    response.headers.add("Access-Control-Allow-Origin", "*")
    response.headers.add('Access-Control-Allow-Headers', "*")
    response.headers.add('Access-Control-Allow-Methods', "*")
    return response
def build_actual_response(response):
    response.headers.add("Access-Control-Allow-Origin", "*")
    return response


#서버 실행
if __name__ == '__main__':
   app.run()